In [1]:
import numpy as np
import pandas as pd

In [2]:
from google.colab import drive
drive.mount("drive")

Mounted at drive

In [18]:
path = '/content/drive/MyDrive/AlmaBetter/Modules/Module 4 : Machine Learning/4.7 - Logistic Regression/Assignment/Copy of WA_Fn-UseC_-Telco-Customer-Churn.csv'
df = pd.read_csv(path)

In [19]:
df.head()

   customerID  gender  SeniorCitizen  ... MonthlyCharges TotalCharges  Churn
0  7590-VHVEG  Female              0  ...          29.85        29.85     No
1  5575-GNVDE    Male              0  ...          56.95       1889.5     No
2  3668-QPYBK    Male              0  ...          53.85       108.15    Yes
3  7795-CFOCW    Male              0  ...          42.30      1840.75     No
4  9237-HQITU  Female              0  ...          70.70       151.65    Yes

[5 rows x 21 columns]

In [20]:
print("The shape of the dataframe is ",df.shape)

The shape of the dataframe is  (7043, 21)

## **Method 1**  by using **df.describe()**

**Logic :-**<br> df.describe() this can only show those where we have numerical values ,<br>that's why first we take the column names which are present in df.describe()*(basically all the numerical value containing columns)* <br> then made an DataFrame called **numeric_col_df**<br>

In [21]:
numer = df.describe()
print(numer)

       SeniorCitizen       tenure  MonthlyCharges
count    7043.000000  7043.000000     7043.000000
mean        0.162147    32.371149       64.761692
std         0.368612    24.559481       30.090047
min         0.000000     0.000000       18.250000
25%         0.000000     9.000000       35.500000
50%         0.000000    29.000000       70.350000
75%         0.000000    55.000000       89.850000
max         1.000000    72.000000      118.750000

In [22]:
numeric_col_name = list(numer.columns)
numeric_col_name

['SeniorCitizen', 'tenure', 'MonthlyCharges']

In [23]:
numeric_col_df = df[numeric_col_name]

In [24]:
numeric_col_df.head()

   SeniorCitizen  tenure  MonthlyCharges
0              0       1           29.85
1              0      34           56.95
2              0       2           53.85
3              0      45           42.30
4              0       2           70.70

In [28]:
print('-'*190)

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Here **categorical_col_name** basically containing **all the categorical column**

In [29]:
# Take all the column name then remove numeric_col_name
#                       list(All_column_name - numric_col_name )
categorical_col_name = list(set(df.columns) - set(numeric_col_name))

In [30]:
for col_name in categorical_col_name:
  print(col_name , end = '  ')

MultipleLines  Churn  TechSupport  StreamingMovies  customerID  OnlineBackup  Dependents  InternetService  PaperlessBilling  DeviceProtection  PaymentMethod  PhoneService  Contract  TotalCharges  StreamingTV  Partner  gender  OnlineSecurity

In [31]:
categorical_col_df = df[categorical_col_name]
categorical_col_df.head(2)

      MultipleLines Churn TechSupport  ... Partner  gender OnlineSecurity
0  No phone service    No          No  ...     Yes  Female             No
1                No    No          No  ...      No    Male            Yes

[2 rows x 18 columns]

## **Method 2** by using **select_dtypes(include / exclude)**

### As U can see out of 21 columns there are only **3 columns which are containing numerical values**


#### Now we will make 2 dataframe *(numerical_data , categorical_data )*

In [ ]:
df.describe()

       SeniorCitizen       tenure  MonthlyCharges
count    7043.000000  7043.000000     7043.000000
mean        0.162147    32.371149       64.761692
std         0.368612    24.559481       30.090047
min         0.000000     0.000000       18.250000
25%         0.000000     9.000000       35.500000
50%         0.000000    29.000000       70.350000
75%         0.000000    55.000000       89.850000
max         1.000000    72.000000      118.750000

In [ ]:
numeric_data = df.select_dtypes(include=[np.number])
categorical_data = df.select_dtypes(exclude=[np.number])

numeric_data.shape[1]
categorical_data.shape[1]

18

In [ ]:
numeric_data.head(2)

   SeniorCitizen  tenure  MonthlyCharges
0              0       1           29.85
1              0      34           56.95

In [ ]:
categorical_data.head(2)

   customerID  gender Partner  ...     PaymentMethod TotalCharges Churn
0  7590-VHVEG  Female     Yes  ...  Electronic check        29.85    No
1  5575-GNVDE    Male      No  ...      Mailed check       1889.5    No

[2 rows x 18 columns]